// 1. Выведите числа от 1 до 50 и от 35 до 8.


// for ( let i = 1 ; i <= 50; i++) {
//     console.log(i)
// }

// for ( let j = 35 ; j >= 8; j--) {
//     console.log(j)
// }

// 2 Выведите столбец чисел от 89 до 11 - воспользуйтесь циклом while и отделите числа
//тегом <br /> друг от друга, чтобы получить столбец, а не строку.

// let i = 89;
// while ( i !== 10) {
//     console.log(i)
//     i--;
// }

// 3 С помощью цикла найдите сумму чисел от 0 до 100.

let sum3 = 0;

for ( let i = 0; i <= 100; i++) {
sum3 += i;

}

console.log(sum3);